app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (booker)
---
  def index
    @users = User.all