app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "booker"]]
---
  def index
    if params[:searching_for] == "1"
      @users = User.where(role: "musician")

INSERT INTO "users" ("email", "first_name", "last_name", "created_at", "updated_at", "encrypted_password", "remember_token") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @user = user_from_params

    if @user.save

UPDATE "users" SET "city" = $1, "role" = $2, "summary" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["city", ""], ["role", ""], ["summary", ""], ["updated_at", 2017-04-30 19:52:26 UTC], ["id", 21]]
---
  def update
    @user = current_user
    if @user.update_attributes(user_params)

DELETE FROM "users" WHERE "users"."id" = $1  [["id", 21]]
---
  def destroy
    User.delete(params[:id])